taskt/Core/Automation/Commands/WindowGroup/AWindowNamesActionCommnads_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AWindowNamesActionCommnads" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.SetWindowsStateCommand" [ label="SetWindowsStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AWindowNamesActionCommnads" [ label="AWindowNamesActionCommnads", style="dashed", ];
"taskt.Core.Automation.Commands.ResizeWindowsCommand" [ label="ResizeWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveWindowsCommand" [ label="MoveWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseWindowsCommand" [ label="CloseWindowsCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.SetWindowsStateCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.ResizeWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.MoveWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.CloseWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
}
